<template>
<el-descriptions>
    <el-descriptions-item label="啊打算">
        <div style="width:100%">

            <xn-ellipsis :content="msg"></xn-ellipsis>
        </div>
    </el-descriptions-item>
</el-descriptions>
</template>

<script>
export default {
  data() {
    return {
        msg:'阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机阿斯加德哈上课觉得还是健康的阿海卡司机'
    }
  },
};
</script>

<style>
</style>